
#include "stm32f10x.h"

const u8 Symbol[] = {
    65,  // A
    160, // Á
    66,  // Â
    161, // Ã
    224, // Ä
    69,  // Å
    163, // Æ
    164, // Ç
    165, // È
    166, // É
    75,  // Ê
    167, // Ë
    77,  // Ì
    72,  // Í
    79,  // Î
    168, // Ï
    80,  // Ğ
    67,  // Ñ
    84,  // Ò
    169, // Ó
    170, // Ô
    88,  // Õ
    225, // Ö
    171, // ×
    172, // Ø
    226, // Ù
    173, // Ú
    174, // Û
    98,  // Ü
    175, // İ
    176, // Ş
    177, // ß
    97,  // à
    178, // á
    179, // â
    180, // ã
    227, // ä
    101, // å
    182, // æ
    183, // ç
    184, // è
    185, // é
    186, // ê
    187, // ë
    188, // ì
    189, // í
    111, // î
    190, // ï
    112, // ğ
    99,  // ñ
    191, // ò
    121, // ó
    228, // ô
    120, // õ
    229, // ö
    192, // ÷
    193, // ø
    230, // ù
    194, // ú
    195, // û
    196, // ü
    197, // ı
    198, // ş
    199  // ÿ
};

u8 SymbolToLCD(u8 sym)
{
   if (sym == ';')
      return 4;
   else if (sym == '[')
      return 0;
   else if (sym == '}')
      return 1;
   else if (sym == '\'')
      return 0;
//   else if (sym == '_')
//      return 218;
//   else if (sym == '^')
//      return 217;
   else  if (sym > 191)
      return Symbol[sym - 192];
   else
      return sym;
}
